#include <stdio.h>


int main(int argc, const char * argv[]) {
    
    /*
     벤치 프레스 10회 3세트
     */
    for(int i = 0; i < 3; i++) {
        for(int j = 0; j < 10; j++) {
            printf("들숨 날숨 ");
        }
        printf("\n");
    }

 
    /*
     별표 5개씩 5줄 출력
     
     *****
     *****
     *****
     *****
     *****
     */
    
    for(int i = 0; i < 5; i++) {
        for(int j = 0; j < 5; j++) {
            printf("*");
        }
        printf("\n");
    }
    
    /*
        0~9 까치 출력 10번
     
     0 1 2 3 4 5 6 7 8 9
     0 1 2 3 4 5 6 7 8 9
     0 1 2 3 4 5 6 7 8 9
     0 1 2 3 4 5 6 7 8 9
     0 1 2 3 4 5 6 7 8 9
     0 1 2 3 4 5 6 7 8 9
     0 1 2 3 4 5 6 7 8 9
     0 1 2 3 4 5 6 7 8 9
     0 1 2 3 4 5 6 7 8 9
     0 1 2 3 4 5 6 7 8 9
     */
    for(int i = 0; i < 10; i++) {
        for(int j = 0; j < 10; j++) {
            printf("%d ", i);
//            printf("%d ", j);
        }
        printf("\n");
    }
    
    
    /*
     00 ~ 99 까지 출력
     
     00 01 02 03 04 05 06 07 08 09
     10 11 12 13 14 15 16 17 18 19
     20 21 22 23 24 25 26 27 28 29
     30 31 32 33 34 35 36 37 38 39
     40 41 42 43 44 45 46 47 48 49
     50 51 52 53 54 55 56 57 58 59
     60 61 62 63 64 65 66 67 68 69
     70 71 72 73 74 75 76 77 78 79
     80 81 82 83 84 85 86 87 88 89
     90 91 92 93 94 95 96 97 98 99
     */
    for(int i = 0; i < 10; i++) {
        for(int j = 0; j < 10; j++) {
            printf("%d%d ",i, j);
        }
        printf("\n");
    }
    
    /*
     
     10개씩 3세트
     1세트 1개째 1세트 2개째....
     2세트 1개째 2세트 2개째....
     */
    
    for(int i = 0; i < 3; i++) {
        for(int j = 0; j < 10; j++) {
            printf("%d 세트 %d 개째 ", i, j);
        }
        printf("\n");
    }
}
